app/controllers/users_controller.rb

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "users" ("name", "gender", "interest_one", "interest_two", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["gender", ""], ["interest_one", ""], ["interest_two", ""], ["created_at", "2015-04-21 20:29:08.317539"], ["updated_at", "2015-04-21 20:29:08.317539"]]
---
    def create
       @city = City.find(params[:city_id])
        @user = User.new( user_params )
        @user.save